In [8]:
import pandas as pd
pd.__version__ # Muestra la version 
import numpy as np

In [2]:
dict_data ={'CO':300,'MX':400,'CH':200} # Diccionario
dict_data

{'CO': 300, 'MX': 400, 'CH': 200}

In [3]:
pd.Series(dict_data)

CO    300
MX    400
CH    200
dtype: int64

In [4]:
dict_data ={'CH':[100,800,200], 'CO':[100,200,300],'MX':[300,500,400]} # Tiene una lista de elemento cada llave
dict_data

{'CH': [100, 800, 200], 'CO': [100, 200, 300], 'MX': [300, 500, 400]}

In [6]:
df = pd.DataFrame(dict_data) # Crea filas(paises) y columnas(n° elemento)
df

    CH   CO   MX
0  100  100  300
1  800  200  500
2  200  300  400

In [9]:
dict_data = {
    'edad': [10,9,13,14,12,11,12],
    'cm': [115,110,130,155,125,120,125],
    'pais':['co','mx','co','mx','mx','ch','ch'],
    'genero':['M','F','F','M','M','M','F'],
    'Q1':[5,10,8,np.nan,7,8,3],
    'Q2':[7,9,9,8,8,8,9]
}
dict_data

{'edad': [10, 9, 13, 14, 12, 11, 12],
 'cm': [115, 110, 130, 155, 125, 120, 125],
 'pais': ['co', 'mx', 'co', 'mx', 'mx', 'ch', 'ch'],
 'genero': ['M', 'F', 'F', 'M', 'M', 'M', 'F'],
 'Q1': [5, 10, 8, nan, 7, 8, 3],
 'Q2': [7, 9, 9, 8, 8, 8, 9]}

In [14]:
df = pd.DataFrame(dict_data, index= ['ana','benito','camilo','daniel','erika','fabian','gabriala']) # En el index tiene que concidir los elementos a intercambiar (0 a 5, deben ser 6 elementos nuevos)
df

          edad   cm pais genero    Q1  Q2
ana         10  115   co      M   5.0   7
benito       9  110   mx      F  10.0   9
camilo      13  130   co      F   8.0   9
daniel      14  155   mx      M   NaN   8
erika       12  125   mx      M   7.0   8
fabian      11  120   ch      M   8.0   8
gabriala    12  125   ch      F   3.0   9

In [15]:
df.index # muestra los datos del index

Index(['ana', 'benito', 'camilo', 'daniel', 'erika', 'fabian', 'gabriala'], dtype='object')

In [16]:
df.columns # Muestra las columnas

Index(['edad', 'cm', 'pais', 'genero', 'Q1', 'Q2'], dtype='object')

In [17]:
df.values() # Muestra los valores

array([[10, 115, 'co', 'M', 5.0, 7],
       [9, 110, 'mx', 'F', 10.0, 9],
       [13, 130, 'co', 'F', 8.0, 9],
       [14, 155, 'mx', 'M', nan, 8],
       [12, 125, 'mx', 'M', 7.0, 8],
       [11, 120, 'ch', 'M', 8.0, 8],
       [12, 125, 'ch', 'F', 3.0, 9]], dtype=object)

In [19]:
df['edad'] # muestra los datos de la columna seleccionada

ana         10
benito       9
camilo      13
daniel      14
erika       12
fabian      11
gabriala    12
Name: edad, dtype: int64

In [20]:
df[['edad','cm','Q1']] # Seleccionando varias columnas

          edad   cm    Q1
ana         10  115   5.0
benito       9  110  10.0
camilo      13  130   8.0
daniel      14  155   NaN
erika       12  125   7.0
fabian      11  120   8.0
gabriala    12  125   3.0

In [21]:
df.loc['ana',['edad','cm','Q1']] # Seleccina un alumno(index) con varios datos

edad     10
cm      115
Q1      5.0
Name: ana, dtype: object

In [23]:
df.loc['daniel','Q1'] # Seleccionar un dato especifico

nan

In [22]:
df.loc[['ana','fabian'],['edad','cm','Q1']] # seleccionar varios alumnos con varios datos

        edad   cm   Q1
ana       10  115  5.0
fabian    11  120  8.0

In [24]:
df

          edad   cm pais genero    Q1  Q2
ana         10  115   co      M   5.0   7
benito       9  110   mx      F  10.0   9
camilo      13  130   co      F   8.0   9
daniel      14  155   mx      M   NaN   8
erika       12  125   mx      M   7.0   8
fabian      11  120   ch      M   8.0   8
gabriala    12  125   ch      F   3.0   9

In [25]:
df.iloc[2,1] # Seleccionar dato por ubicacion numerica

130

In [27]:
df.iloc[2,[1,3]] # Seleccionado mas datos por ubicacion

cm        130
genero      F
Name: camilo, dtype: object

In [28]:
df.iloc[[2,4,5],[1,3]] # Seleccionando varios index

         cm genero
camilo  130      F
erika   125      M
fabian  120      M

In [29]:
 df.iloc[:,[1,3]] # Seleccionar la columna de index completa

           cm genero
ana       115      M
benito    110      F
camilo    130      F
daniel    155      M
erika     125      M
fabian    120      M
gabriala  125      F

In [31]:
df['edad'] >= 12 # todas las personas mayores o iguales a 12 resp en booleano

ana         False
benito      False
camilo       True
daniel       True
erika        True
fabian      False
gabriala     True
Name: edad, dtype: bool

In [32]:
df[df['edad'] >= 12] # Muestra un subconjunto de datos filtrado por la edad

          edad   cm pais genero   Q1  Q2
camilo      13  130   co      F  8.0   9
daniel      14  155   mx      M  NaN   8
erika       12  125   mx      M  7.0   8
gabriala    12  125   ch      F  3.0   9

In [43]:
df.query('edad >= 12') # Consultando por querys

          edad   cm pais genero   Q1  Q2
camilo      13  130   co      F  8.0   9
daniel      14  155   mx      M  NaN   8
erika       12  125   mx      M  7.0   8
gabriala    12  125   ch      F  3.0   9

In [42]:
df[(df['edad'] >= 12) & (df['pais'] =='mx')] # Seleccionando cuyos estudiantes sean mayor o igual a 12 y que sean de mexico "mx"

        edad   cm pais genero   Q1  Q2
daniel    14  155   mx      M  NaN   8
erika     12  125   mx      M  7.0   8

In [45]:
df['Q2'] >= df['Q1'] # Comparaciones entre 2 datos (estudiantes que tuvieron una mejora en Q2 vs Q1)

ana          True
benito      False
camilo       True
daniel      False
erika        True
fabian       True
gabriala     True
dtype: bool

In [47]:
df[df['Q2'] >= df['Q1']] # Comparaciones entre 2 datos (estudiantes que tuvieron una mejora en Q2 vs Q1)

          edad   cm pais genero   Q1  Q2
ana         10  115   co      M  5.0   7
camilo      13  130   co      F  8.0   9
erika       12  125   mx      M  7.0   8
fabian      11  120   ch      M  8.0   8
gabriala    12  125   ch      F  3.0   9

In [48]:
df.info() # devuelve un resumen con la estructura de las variables y el tipo de datos que contienen.

<class 'pandas.core.frame.DataFrame'>
Index: 7 entries, ana to gabriala
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   edad    7 non-null      int64
 1   cm      7 non-null      int64
 2   pais    7 non-null      object
 3   genero  7 non-null      object
 4   Q1      6 non-null      float64
 5   Q2      7 non-null      int64
dtypes: float64(1), int64(3), object(2)
memory usage: 692.0+ bytes

In [49]:
df.describe() #  devuelve un summary() de tu set de datos. Si tienes variables numericas te devolvera: minimo. maximo, media,std,…etc de las columnas numericas.

            edad          cm         Q1        Q2
count   7.000000    7.000000   6.000000  7.000000
mean   11.571429  125.714286   6.833333  8.285714
std     1.718249   14.556949   2.483277  0.755929
min     9.000000  110.000000   3.000000  7.000000
25%    10.500000  117.500000   5.500000  8.000000
50%    12.000000  125.000000   7.500000  8.000000
75%    12.500000  127.500000   8.000000  9.000000
max    14.000000  155.000000  10.000000  9.000000